gap> START_TEST("dfsTest");
gap> g := Graph([[2, 4], [3, 5], [], [6], [3, 4], [1]]);
<object>
gap> DFS(g, 1);
[ 1, 4, 6, 2, 5, 3 ]

gap> g := Graph([[2, 4], [3, 5], [], [6], [3, 2], [1]]);
<object>
gap> DFS(g, 2);
[ 2, 5, 3 ]
gap> STOP_TEST("dfs.test", 1000);
