gap> START_TEST("colouringTest");

# Test colouring a graph that can be coloured with 3 colours.
gap> g := Graph([[3, 4, 5], [3], [1, 2, 4], [1, 3, 5, 6], [1, 4, 6], [4, 5]]);
<object>
gap> GetColouring(g, 3);
[ 1, 1, 2, 3, 2, 1 ]

# Test that it can't be coloured with 2 colours, as it contains K_3.
gap> GetColouring(g, 2);
false

gap> STOP_TEST("colouring.test", 1000);
