gap> START_TEST("colouringTest");

# Test colouring a graph that can be coloured with 3 colours.
gap> g := Graph([[3, 4, 5], [3], [1, 2, 4], [1, 3, 5, 6], [1, 4, 6], [4, 5]]);
<object>
gap> GetColouring(g, 3);
[ 1, 1, 2, 3, 2, 1 ]

# Test that it can't be coloured with 2 colours, as it contains K_3.
gap> GetColouring(g, 2);
false

gap> g := Graph([ [ 3, 8, 14, 17 ], [ 8, 10, 11, 15 ], [ 1, 6, 7, 8, 15, 16, 17 ], [], [ 6, 12, 16, 17 ], [ 3, 5, 14 ], [ 3, 10, 18 ], [ 1, 2, 3, 9, 12, 16, 17 ], [ 8, 15 ], [ 2, 7, 17 ], [ 2, 13 ], [ 5, 8 ], [ 11, 15 ], [ 1, 6 ], [ 2, 3, 9, 13, 18 ], [ 3, 5, 8 ], [ 1, 3, 5, 8, 10 ], [ 7, 15 ] ]);
<object>
gap> GetColouring(g, 3);
false

gap> STOP_TEST("colouring.test", 1000);
